m3iz/pic12f476-uart/Main.c
#include <xc.h>

#define _XTAL_FREQ 4000000  // ?????????? ??????? ????????? ?????????? (????????, 4 ???)

#define Baudrate       1200                      // ???????? ???????? ?????? (???/?)
#define OneBitDelay    (1000000 / Baudrate)      // ???????? ??? ?????? ???? ? ?????????????
#define DataBitCount   8                         // ?????????? ??? ??????

#define UART_TX        GP0                       // TX ??? ??? ???????? ??????
#define UART_TX_DIR    TRISIO0                   // ??????????? ????? ??? TX
#define UART_RX        GP1                         // RX ??? ??? ?????? ??????
#define UART_RX_DIR    TRISIO1                     // ??????????? ????? ??? RX

// ???????????? ??? PIC12F675
__CONFIG(FOSC_INTRCIO & WDTE_OFF & PWRTE_ON & MCLRE_OFF & BOREN_ON & CP_OFF & CPD_OFF);

void InitSoftUART(void) {
    UART_TX = 1;          // ?????????? TX ??? ? ??????? ??????? ? ?????? ????????
    UART_TX_DIR = 0;      // ?????????? TX ??? ?????
    UART_RX_DIR = 1;      // ?????????? RX ??? ????
}

char UART_Receive(void) {
    char ReceivedValue = 0;

    // ???? ?????? ???????? (????????? ???)
    while (UART_RX == 1);  // ????????, ???? ????? RX ?? ?????? ?????? (????????? ???)

    __delay_us(OneBitDelay); // ?????????? ????? ??? ???????????? ???????

    // ?????? ?????? ??????? (LSB ??????)
    for (unsigned char i = 0; i < DataBitCount; i++) {
        ReceivedValue |= (UART_RX << i);  // ????????? ??????? ???
        __delay_us(OneBitDelay);
    }

    // ???? ????????? ???????? (???????? ???)
    __delay_us(OneBitDelay);

    return ReceivedValue;
}

void UART_Transmit(const char DataValue) {
    // ???????? ?????????? ????
    UART_TX = 0;
    __delay_us(OneBitDelay);

    // ???????? ?????? ??????? (LSB ??????)
    for (unsigned char i = 0; i < DataBitCount; i++) {
        UART_TX = (DataValue >> i) & 0x1;  // ?????????? TX ? ???????????? ? ?????
        __delay_us(OneBitDelay);
    }

    // ???????? ????????? ????
    UART_TX = 1;
    __delay_us(OneBitDelay);
}

void UART_SendString(const char* str) {
    while (*str) {            // ???? ?? ????????? ????? ??????
        UART_Transmit(*str);   // ???????? ??????? ??????
        str++;                 // ??????? ? ?????????? ???????
    }
}

void main() {
    // ????????? ????? ? UART
    ANSEL = 0x00;       // ?????????? ????? ??? ????????
    CMCON = 0x07;       // ????????? ??????????
    InitSoftUART();     // ???????????????? UART

    while (1) {
        while (UART_RX == 1){}; 
        UART_SendString("hello");  // ????????? ????????? "hello"
        __delay_ms(1000);          // ???????? ????? ????????? ?????????
    }
}
